<a href="https://colab.research.google.com/github/AZHARTHEGEEK/AI-DATA-SCIENCE-WORK/blob/main/Class%20Assignment%20Work.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Class Work

In [37]:
import pandas as pd
import numpy as np
dic = {"Name":["Azhar","Mehar","Qandeel","Owaise","Taha"],
       "Age": [21,22,24,25,10],
        "Courses": ["Python","Java","React","C+","AI"],
        "Python":[12,54,45,98,45],
        "Java":[12,21,52,21,21],
        "React":[48,45,54,66,45],
       }

In [38]:
data =pd.DataFrame(dic)

In [39]:
data

      Name  Age Courses  Python  Java  React
0    Azhar   21  Python      12    12     48
1    Mehar   22    Java      54    21     45
2  Qandeel   24   React      45    52     54
3   Owaise   25      C+      98    21     66
4     Taha   10      AI      45    21     45

In [40]:
data["Total"] = data['Python']+data['Java'] + data['React']

In [41]:
data

      Name  Age Courses  Python  Java  React  Total
0    Azhar   21  Python      12    12     48     72
1    Mehar   22    Java      54    21     45    120
2  Qandeel   24   React      45    52     54    151
3   Owaise   25      C+      98    21     66    185
4     Taha   10      AI      45    21     45    111

In [42]:
data["Total Marks"]=[200 for n in data["Total"]]

In [43]:
data

      Name  Age Courses  Python  Java  React  Total  Total Marks
0    Azhar   21  Python      12    12     48     72          200
1    Mehar   22    Java      54    21     45    120          200
2  Qandeel   24   React      45    52     54    151          200
3   Owaise   25      C+      98    21     66    185          200
4     Taha   10      AI      45    21     45    111          200

In [44]:
data["Result"]=["Pass" if n >= 120 else "Try Again"for n in data["Total"]]

In [45]:
data

      Name  Age Courses  Python  Java  React  Total  Total Marks     Result
0    Azhar   21  Python      12    12     48     72          200  Try Again
1    Mehar   22    Java      54    21     45    120          200       Pass
2  Qandeel   24   React      45    52     54    151          200       Pass
3   Owaise   25      C+      98    21     66    185          200       Pass
4     Taha   10      AI      45    21     45    111          200  Try Again

In [46]:
data["Each Course"]= ["Pass" if (python>=30 and Java>30 and React>30) else "Try Again" for python ,Java,React  in zip(data["Python"],data["Java"],data["React"])]

In [47]:
data

      Name  Age Courses  Python  ...  Total  Total Marks     Result  Each Course
0    Azhar   21  Python      12  ...     72          200  Try Again    Try Again
1    Mehar   22    Java      54  ...    120          200       Pass    Try Again
2  Qandeel   24   React      45  ...    151          200       Pass         Pass
3   Owaise   25      C+      98  ...    185          200       Pass    Try Again
4     Taha   10      AI      45  ...    111          200  Try Again    Try Again

[5 rows x 10 columns]

In [50]:
data["Percentage"]=[round((om/200)*100) for om in data["Total"]]

In [51]:
data

      Name  Age Courses  Python  ...  Total Marks     Result  Each Course  Percentage
0    Azhar   21  Python      12  ...          200  Try Again    Try Again          36
1    Mehar   22    Java      54  ...          200       Pass    Try Again          60
2  Qandeel   24   React      45  ...          200       Pass         Pass          76
3   Owaise   25      C+      98  ...          200       Pass    Try Again          92
4     Taha   10      AI      45  ...          200  Try Again    Try Again          56

[5 rows x 11 columns]

In [ ]:
# data["Grade"]=["A+" if pn >90 else "A" if pn>70 for pn in "Percentage"]